scripts/event-and-env-vars/start_workflow/event-procedures.json

{
    "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n <soapenv:Body>\n  <notifications xmlns=\"http://soap.sforce.com/2005/09/outbound\">\n   <OrganizationId>00D2E000000oF5KUAU</OrganizationId>\n   <ActionId>04kTV000001AjCzYAK</ActionId>\n   <SessionId>00D2E000000oF5K!AQEAQHCoLv01DjdHxNW2SUpwKDcJxI1BAnTmPG0C0a3BIarD3slQMH23e8TGUPye1OX1BVjfvC6k3p.OkvDBQ8BSwRkLYZiF</SessionId>\n   <EnterpriseUrl>https://shulman-hill.my.salesforce.com/services/Soap/c/61.0/00D2E000000oF5K</EnterpriseUrl>\n   <PartnerUrl>https://shulman-hill.my.salesforce.com/services/Soap/u/61.0/00D2E000000oF5K</PartnerUrl>\n   <Notification>\n    <Id>04lTV00000581X7YAI</Id>\n    <sObject xsi:type=\"sf:Treatment_Custom__c\" xmlns:sf=\"urn:sobject.enterprise.soap.sforce.com\">\n     <sf:Id>a32TV000000n1EHYAY</sf:Id>\n     <sf:File_Info_Id__c>a2VTV000001I42z2AC</sf:File_Info_Id__c>\n     <sf:Record_Type_Name__c>Procedures</sf:Record_Type_Name__c>\n    </sObject>\n   </Notification>\n  </notifications>\n </soapenv:Body>\n</soapenv:Envelope>"
}